imskriaz/IoT/firmware/espidf/esp32-s3-a7670e-idf6.1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# Full newlib formatting is required by status/storage JSON, which emits
# 64-bit byte counters through PRIu64. The nano formatter does not support
# those conversions on ESP32-S3 and can interpret the argument list wrongly.
# CONFIG_LIBC_NEWLIB_NANO_FORMAT is not set
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Keep the first v6.1 build behaviorally close to the verified 5.3.1 image.
# PicolibC and flash-resident FreeRTOS are benchmarked separately after parity.
CONFIG_LIBC_NEWLIB=y
CONFIG_LIBC_NEWLIB_NANO_FORMAT=n
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# ESP-IDF 6.1/Mbed TLS 4 requires the bundle callback for chains that terminate
# through a cross-signed root (the production Cloudflare chain uses GTS Root R4
# cross-signed by GlobalSign). Keep hostname and certificate verification on.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_UNIFIED_TASK_REGISTRY_CAPACITY=24
CONFIG_UNIFIED_HEALTH_MODULE_CAPACITY=32
CONFIG_UNIFIED_TASK_STACK_SMALL=4096
CONFIG_UNIFIED_TASK_STACK_MEDIUM=8192
CONFIG_UNIFIED_TASK_STACK_LARGE=8192
CONFIG_UNIFIED_TASK_STACK_XLARGE=12288
CONFIG_UNIFIED_HEALTH_INTERVAL_MS=5000
CONFIG_UNIFIED_DIAGNOSTICS_INTERVAL_MS=5000
CONFIG_UNIFIED_STORAGE_RECORD_CAPACITY=32
CONFIG_UNIFIED_STORAGE_MOUNT_RETRY_MS=15000
CONFIG_UNIFIED_STORAGE_TASK_STACK_SIZE=16384
CONFIG_UNIFIED_STORAGE_MAX_OPEN_FILES=8
CONFIG_UNIFIED_WIFI_DISABLE_POWER_SAVE=y
CONFIG_UNIFIED_MODEM_UART_PORT=1
CONFIG_UNIFIED_BOARD_MODEM_ENABLE_PIN=21
CONFIG_UNIFIED_MODEM_UART_BAUD_RATE=115200
CONFIG_UNIFIED_MODEM_UART_RX_BUFFER=4096
CONFIG_UNIFIED_MODEM_AT_TIMEOUT_MS=3000
CONFIG_UNIFIED_MODEM_PROBE_INTERVAL_MS=5000
CONFIG_UNIFIED_API_BRIDGE_PAYLOAD_LEN=8192
CONFIG_MBEDTLS_HAVE_TIME_DATE=y
# Compile lwIP PPP support for controlled trials only. Normal cellular
# fallback still uses the modem's AT/MQTT service; enabling this stack does
# not start USB or UART PPP or change modem ownership.
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_ENABLE_IPV4=y
CONFIG_LWIP_PPP_ENABLE_IPV6=n
CONFIG_LWIP_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_UNIFIED_API_BRIDGE_HISTORY_DEPTH=20
CONFIG_UNIFIED_AUTOMATION_QUEUE_DEPTH=16
